In [40]:
data1 = [(7369, "SMITH", "CLERK", 7902, "17-DEC-2005", 800, None, 20),
        (7499, "ALLEN", "SALESMAN",7698,"20-FEB-2006",1600,300,  30),
        (7521, "WARD", "SALESMAN", 7698,"22-FEB-2006",1250,500,  30),
        (7566, "JONES", "MANAGER", 7839, "02-APR-2006",2975,None,20),
        (7654, "MARTIN", "SALESMAN", 7698, "28-SEP-2006",1250,1400,30),
        (7698, "BLAKE", "MANAGER", 7839, "01-MAY-2006", 2850, None,30),
        (7782, "CLARK", "MANAGER", 7839, "09-JUN-2006", 2450, None, 10),
        (7788, "SCOTT", "ANALYST", 7566, "09-DEC-2007", 3000, None, 20),
        (7839, "KING", "PRESIDENT",None, "17-NOV-2006", 5000, None, 10),
        (7844, "Turner", "SALESMAN",7698, "08-SEP-2006", 1500, 0,  30),
        (7876, "ADAMS", "CLERK",   7788,  "12-JAN-2008", 1100, None, 20),
        (7900, "JAMES",  "CLERK",  7698,  "03-DEC-2006", 950, None, 30),
        (7902, "FORD",  "ANALYST", 7566,  "03-DEC-2006", 3000, None, 20),
        (7934, "MILLER", "CLERK",  7782,  "23-JAN-2007", 1300, None, 10)
       ]
schema1 = ["empno","ename","job","mgr","hiredate","sal","comm","deptno"]

In [41]:
from pyspark.sql import SparkSession 
from pyspark.sql.functions import *
spark = SparkSession.builder.getOrCreate()
emp_df = spark.createDataFrame(data1,schema1)

In [43]:
#df.show()
emp_df.createOrReplaceTempView('emp')

In [44]:
data2 = [(10, "ACCOUNTING", "NEW YORK"),
         (20, "RESEARCH", "DALLAS"),
         (30, "SALES",    "CHICAGO"),
         (40, "OPERATIONS", "BOSTON") ]
schema2 = ["deptno", "dname", "loc"]

In [21]:
dept_df = spark.createDataFrame(data = data2, schema = schema2)

In [23]:
#df2.show()
emp_df.createOrReplaceTempView('dept')

In [24]:
spark.sql('''select * from dept''').show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-APR-2006|2975|NULL|    20|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|01-MAY-2006|2850|NULL|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7788| SCOTT|  ANALYST|7566|09-DEC-2007|3000|NULL|    20|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-2006| 950|NULL|    30|
| 7902|  FORD|  ANALYST|7566|03-DEC-2006|3000|NULL|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

# Retrieving All Rows and Columns from a Table

### %SQL

In [14]:
spark.sql('''select * from dept''').show()

+------+----------+--------+
|deptno|     dname|     loc|
+------+----------+--------+
|    10|ACCOUNTING|NEW YORK|
|    20|  RESEARCH|  DALLAS|
|    30|     SALES| CHICAGO|
|    40|OPERATIONS|  BOSTON|
+------+----------+--------+

In [15]:
spark.sql('''select * from emp''').show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-APR-2006|2975|NULL|    20|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|01-MAY-2006|2850|NULL|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7788| SCOTT|  ANALYST|7566|09-DEC-2007|3000|NULL|    20|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-2006| 950|NULL|    30|
| 7902|  FORD|  ANALYST|7566|03-DEC-2006|3000|NULL|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

### %pyspark

In [25]:
emp_df.show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-APR-2006|2975|NULL|    20|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|01-MAY-2006|2850|NULL|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7788| SCOTT|  ANALYST|7566|09-DEC-2007|3000|NULL|    20|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-2006| 950|NULL|    30|
| 7902|  FORD|  ANALYST|7566|03-DEC-2006|3000|NULL|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

In [21]:
dept_df.show()

+------+----------+--------+
|deptno|     dname|     loc|
+------+----------+--------+
|    10|ACCOUNTING|NEW YORK|
|    20|  RESEARCH|  DALLAS|
|    30|     SALES| CHICAGO|
|    40|OPERATIONS|  BOSTON|
+------+----------+--------+

# Retrieving a subset of rows from a table

In [23]:
spark.sql('''select * from emp
          where deptno = 10
          ''').show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

# Finding Rows that satisfy multiple conditions

### %sql

In [14]:
spark.sql('''select *
          from emp
          where deptno = 10
          or comm is not null
          or sal <= 2000 and deptno = 20
          ''').show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

### %pyspark

In [34]:
#df1.filter((df1.deptno == 10)| ("comm is not NULL")).show()
#cond1 = (emp_df.comm.isNotNull()) #("comm is not NULL")
#cond2 = (emp_df.deptno == 10)
cond1 = expr("comm is NOT NULL")
cond2 = expr("deptno = 10")
emp_df.filter(cond1|cond2 | (emp_df.sal<=2000) & (emp_df.deptno==20)).show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|
+-----+------+---------+----+-----------+----+----+------+

In [57]:
df1.filter((df1.sal<=2000) & (df1.deptno==20)).show()

+-----+-----+-----+----+-----------+----+----+------+
|empno|ename|  job| mgr|   hiredate| sal|comm|deptno|
+-----+-----+-----+----+-----------+----+----+------+
| 7369|SMITH|CLERK|7902|17-DEC-2005| 800|NULL|    20|
| 7876|ADAMS|CLERK|7788|12-JAN-2008|1100|NULL|    20|
+-----+-----+-----+----+-----------+----+----+------+

# Retrieving a subset of columns

### %sql

In [64]:
spark.sql('''select ename, deptno, sal from emp''').show()

+------+------+----+
| ename|deptno| sal|
+------+------+----+
| SMITH|    20| 800|
| ALLEN|    30|1600|
|  WARD|    30|1250|
| JONES|    20|2975|
|MARTIN|    30|1250|
| BLAKE|    30|2850|
| CLARK|    10|2450|
| SCOTT|    20|3000|
|  KING|    10|5000|
|Turner|    30|1500|
| ADAMS|    20|1100|
| JAMES|    30| 950|
|  FORD|    20|3000|
|MILLER|    10|1300|
+------+------+----+

In [35]:
#emp_df.select('ename','deptno','sal').show() 
#emp_df.select(emp_df.ename,emp_df.deptno,emp_df.sal).show()

+------+------+----+
| ename|deptno| sal|
+------+------+----+
| SMITH|    20| 800|
| ALLEN|    30|1600|
|  WARD|    30|1250|
| JONES|    20|2975|
|MARTIN|    30|1250|
| BLAKE|    30|2850|
| CLARK|    10|2450|
| SCOTT|    20|3000|
|  KING|    10|5000|
|Turner|    30|1500|
| ADAMS|    20|1100|
| JAMES|    30| 950|
|  FORD|    20|3000|
|MILLER|    10|1300|
+------+------+----+

# Providing Meaningful Names for Columns

In [70]:
spark.sql('''select sal AS salary, comm AS commission from emp''').show()

+------+----------+
|salary|commission|
+------+----------+
|   800|      NULL|
|  1600|       300|
|  1250|       500|
|  2975|      NULL|
|  1250|      1400|
|  2850|      NULL|
|  2450|      NULL|
|  3000|      NULL|
|  5000|      NULL|
|  1500|         0|
|  1100|      NULL|
|   950|      NULL|
|  3000|      NULL|
|  1300|      NULL|
+------+----------+

In [ ]:
emp_df1.select(col('sal').alias('salary'),col('comm').alias('commission')).show()

In [39]:
df = (emp_df.select(col('sal').alias('salary'),col('comm').alias('commission'))
      .filter(expr("sal < 5000"))
)
df.show()
#df.where(col("salary")<5000).show()
#emp_df.filter(expr("sal < 5000")).show()

+------+----------+
|salary|commission|
+------+----------+
|   800|      NULL|
|  1600|       300|
|  1250|       500|
|  2975|      NULL|
|  1250|      1400|
|  2850|      NULL|
|  2450|      NULL|
|  3000|      NULL|
|  1500|         0|
|  1100|      NULL|
|   950|      NULL|
|  3000|      NULL|
|  1300|      NULL|
+------+----------+

# Concating Column Values

In [17]:
spark.sql('''select concat(ename, ' WORKS AS A ', job) AS msg from emp''').show()

+--------------------+
|                 msg|
+--------------------+
|SMITH WORKS AS A ...|
|ALLEN WORKS AS A ...|
|WARD WORKS AS A S...|
|JONES WORKS AS A ...|
|MARTIN WORKS AS A...|
|BLAKE WORKS AS A ...|
|CLARK WORKS AS A ...|
|SCOTT WORKS AS A ...|
|KING WORKS AS A P...|
|Turner WORKS AS A...|
|ADAMS WORKS AS A ...|
|JAMES WORKS AS A ...|
|FORD WORKS AS A A...|
|MILLER WORKS AS A...|
+--------------------+

pyspark.sql.functions provide two functions concat and concat_ws to concatenate multiple columns into a single column. concat_ws is known as concat with a separator.

In [16]:
emp_df1.select(concat_ws(' WORKS AS ',emp_df1.ename, emp_df1.job).alias('msg')).show(truncate=False)

+------------------------+
|msg                     |
+------------------------+
|SMITH WORKS AS CLERK    |
|ALLEN WORKS AS SALESMAN |
|WARD WORKS AS SALESMAN  |
|JONES WORKS AS MANAGER  |
|MARTIN WORKS AS SALESMAN|
|BLAKE WORKS AS MANAGER  |
|CLARK WORKS AS MANAGER  |
|SCOTT WORKS AS ANALYST  |
|KING WORKS AS PRESIDENT |
|Turner WORKS AS SALESMAN|
|ADAMS WORKS AS CLERK    |
|JAMES WORKS AS CLERK    |
|FORD WORKS AS ANALYST   |
|MILLER WORKS AS CLERK   |
+------------------------+

# Using Conditional Logic in a SELECT Statement

In [9]:
spark.sql('''select ename, sal,
            case
            when sal <= 2000 then 'underpaid' 
            when sal >= 4000 then 'overpaid'
            else 'OK'
            end AS status from emp''').show()

+------+----+---------+
| ename| sal|   status|
+------+----+---------+
| SMITH| 800|underpaid|
| ALLEN|1600|underpaid|
|  WARD|1250|underpaid|
| JONES|2975|       OK|
|MARTIN|1250|underpaid|
| BLAKE|2850|       OK|
| CLARK|2450|       OK|
| SCOTT|3000|       OK|
|  KING|5000| overpaid|
|Turner|1500|underpaid|
| ADAMS|1100|underpaid|
| JAMES| 950|underpaid|
|  FORD|3000|       OK|
|MILLER|1300|underpaid|
+------+----+---------+

In [11]:
emp_df1.withColumn("status",
                   when (emp_df1.sal<=2000, "underpaid")
                   .when (emp_df1.sal>=4000, "overpaid")
                   .otherwise("OK") ).show()

+-----+------+---------+----+-----------+----+----+------+---------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|   status|
+-----+------+---------+----+-----------+----+----+------+---------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|NULL|    20|underpaid|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|underpaid|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|underpaid|
| 7566| JONES|  MANAGER|7839|02-APR-2006|2975|NULL|    20|       OK|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|underpaid|
| 7698| BLAKE|  MANAGER|7839|01-MAY-2006|2850|NULL|    30|       OK|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|NULL|    10|       OK|
| 7788| SCOTT|  ANALYST|7566|09-DEC-2007|3000|NULL|    20|       OK|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|NULL|    10| overpaid|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|underpaid|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|NULL|    20|underpaid|
| 7900| JAMES|    CLERK|7698|03-DEC-2006| 950|NULL|    30|underpaid|
| 7902|  FORD|  ANALYST|7566|03-DEC-2006|3000|NULL|    20|       OK|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|NULL|    10|underpaid|
+-----+------+---------+----+-----------+----+----+------+---------+

# Returning n Random Records from a Table.

In [19]:
spark.sql("select ename,job from emp order by rand() limit 5").show()

+------+---------+
| ename|      job|
+------+---------+
|  WARD| SALESMAN|
| BLAKE|  MANAGER|
|MARTIN| SALESMAN|
|  KING|PRESIDENT|
|  FORD|  ANALYST|
+------+---------+

In [22]:
#Pyspark Replace NULL/None Values with Zero.
#emp_df1.na.fill(value=0).show()
emp_df1.na.fill(value=0,subset=["comm"]).show()

+-----+------+---------+----+-----------+----+----+------+
|empno| ename|      job| mgr|   hiredate| sal|comm|deptno|
+-----+------+---------+----+-----------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-DEC-2005| 800|   0|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-2006|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-2006|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-APR-2006|2975|   0|    20|
| 7654|MARTIN| SALESMAN|7698|28-SEP-2006|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|01-MAY-2006|2850|   0|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-2006|2450|   0|    10|
| 7788| SCOTT|  ANALYST|7566|09-DEC-2007|3000|   0|    20|
| 7839|  KING|PRESIDENT|NULL|17-NOV-2006|5000|   0|    10|
| 7844|Turner| SALESMAN|7698|08-SEP-2006|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|12-JAN-2008|1100|   0|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-2006| 950|   0|    30|
| 7902|  FORD|  ANALYST|7566|03-DEC-2006|3000|   0|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-2007|1300|   0|    10|
+-----+------+---------+----+-----------+----+----+------+

# Searching for Patterns

In [24]:
spark.sql('''select ename, job 
            from emp
            where deptno in (10, 20) 
            and (ename like '%I%' and job like '%ER') ''').show()

+-----+---+
|ename|job|
+-----+---+
+-----+---+